MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKL03Z16VFG4/mcu.h
#define SMC_PMPROT                    (*((volatile uint32_t *)0x4007E000))      // Power Mode Protection register (SMC_PMPROT)
#define SMC_PMCTRL                    (*((volatile uint32_t *)0x4007E001))      // Power Mode Control register (SMC_PMCTRL)
#define SMC_STOPCTRL                  (*((volatile uint32_t *)0x4007E002))      // Stop Control Register (SMC_STOPCTRL)
#define SMC_PMSTAT                    (*((volatile uint32_t *)0x4007E003))      // Power Mode Status register (SMC_PMSTAT)


//*****************************************************************************
//
// Power Management Controller (PMC) registers
//
//*****************************************************************************

#define PMC_LVDSC1                    (*((volatile uint32_t *)0x4007D000))      // Low Voltage Detect Status And Control 1 register
#define PMC_LVDSC2                    (*((volatile uint32_t *)0x4007D001))      // Low Voltage Detect Status And Control 2 register
#define PMC_REGSC                     (*((volatile uint32_t *)0x4007D002))      // Regulator Status And Control register


//*****************************************************************************
//
// Miscellaneous Control Module (MCM) registers
//
//*****************************************************************************

#define MCM_PLASC                     (*((volatile uint32_t *)0xF0003008))      // Crossbar Switch (AXBS) Slave Configuration
#define MCM_PLAMC                     (*((volatile uint32_t *)0xF000300A))      // Crossbar Switch (AXBS) Master Configuration
#define MCM_PLACR                     (*((volatile uint32_t *)0xF000300C))      // Platform Control Register
#define MCM_CPO                       (*((volatile uint32_t *)0xF0003040))      // Compute Operation Control Register


//*****************************************************************************
//
// Reset Control Module (RCM) registers
//
//*****************************************************************************

#define RCM_SRS0                      (*((volatile uint32_t *)0x4007F000))      // System Reset Status Register 0 (RCM_SRS0)
#define RCM_SRS1                      (*((volatile uint32_t *)0x4007F001))      // System Reset Status Register 1 (RCM_SRS1)
#define RCM_RPFC                      (*((volatile uint32_t *)0x4007F004))      // Reset Pin Filter Control register (RCM_RPFC)
#define RCM_RPFW                      (*((volatile uint32_t *)0x4007F005))      // Reset Pin Filter Width register (RCM_RPFW)
#define RCM_FM                        (*((volatile uint32_t *)0x4007F006))      // Force Mode Register (RCM_FM)
#define RCM_MR                        (*((volatile uint32_t *)0x4007F007))      // Mode Register (RCM_MR)
#define RCM_SSRS0                     (*((volatile uint32_t *)0x4007F008))      // Sticky System Reset Status Register 0 (RCM_SSRS0)
#define RCM_SSRS1                     (*((volatile uint32_t *)0x4007F009))      // Sticky System Reset Status Register 1 (RCM_SSRS1)


//*****************************************************************************
//
// Micro Trace Buffer (MTB) registers
//
//*****************************************************************************

#define MTB_POSITION                  (*((volatile uint32_t *)0xF0000000))      // MTB Position Register (MTB_POSITION)
#define MTB_MASTER                    (*((volatile uint32_t *)0xF0000004))      // MTB Master Register (MTB_MASTER)
#define MTB_FLOW                      (*((volatile uint32_t *)0xF0000008))      // MTB Flow Register (MTB_FLOW)
#define MTB_BASE                      (*((volatile uint32_t *)0xF000000C))      // MTB Base Register (MTB_BASE)
#define MTB_MODECTRL                  (*((volatile uint32_t *)0xF0000F00))      // Integration Mode Control Register (MTB_MODECTRL)
#define MTB_TAGSET                    (*((volatile uint32_t *)0xF0000FA0))      // Claim TAG Set Register (MTB_TAGSET)
#define MTB_TAGCLEAR                  (*((volatile uint32_t *)0xF0000FA4))      // Claim TAG Clear Register (MTB_TAGCLEAR)
#define MTB_LOCKACCESS                (*((volatile uint32_t *)0xF0000FB0))      // Lock Access Register (MTB_LOCKACCESS)
#define MTB_LOCKSTAT                  (*((volatile uint32_t *)0xF0000FB4))      // Lock Status Register (MTB_LOCKSTAT)
#define MTB_AUTHSTAT                  (*((volatile uint32_t *)0xF0000FB8))      // Authentication Status Register (MTB_AUTHSTAT)
#define MTB_DEVICEARCH                (*((volatile uint32_t *)0xF0000FBC))      // Device Architecture Register (MTB_DEVICEARCH)
#define MTB_DEVICECFG                 (*((volatile uint32_t *)0xF0000FC8))      // Device Configuration Register (MTB_DEVICECFG)
#define MTB_DEVICETYPID               (*((volatile uint32_t *)0xF0000FCC))      // Device Type Identifier Register (MTB_DEVICETYPID)
#define MTB_PERIPHID4                 (*((volatile uint32_t *)0xF0000FD0))      // Peripheral ID Register (MTB_PERIPHID4)
#define MTB_PERIPHID5                 (*((volatile uint32_t *)0xF0000FD4))      // Peripheral ID Register (MTB_PERIPHID5)
#define MTB_PERIPHID6                 (*((volatile uint32_t *)0xF0000FD8))      // Peripheral ID Register (MTB_PERIPHID6)
#define MTB_PERIPHID7                 (*((volatile uint32_t *)0xF0000FDC))      // Peripheral ID Register (MTB_PERIPHID7)
#define MTB_PERIPHID0                 (*((volatile uint32_t *)0xF0000FE0))      // Peripheral ID Register (MTB_PERIPHID0)
#define MTB_PERIPHID1                 (*((volatile uint32_t *)0xF0000FE4))      // Peripheral ID Register (MTB_PERIPHID1)
#define MTB_PERIPHID2                 (*((volatile uint32_t *)0xF0000FE8))      // Peripheral ID Register (MTB_PERIPHID2)
#define MTB_PERIPHID3                 (*((volatile uint32_t *)0xF0000FEC))      // Peripheral ID Register (MTB_PERIPHID3)
#define MTB_COMPID0                   (*((volatile uint32_t *)0xF0000FF0))      // Component ID Register (MTB_COMPID0)
#define MTB_COMPID1                   (*((volatile uint32_t *)0xF0000FF4))      // Component ID Register (MTB_COMPID1)
#define MTB_COMPID2                   (*((volatile uint32_t *)0xF0000FF8))      // Component ID Register (MTB_COMPID2)
#define MTB_COMPID3                   (*((volatile uint32_t *)0xF0000FFC))      // Component ID Register (MTB_COMPID3)


//*****************************************************************************
//
// Multipurpose Clock Generator Lite (MCG_Lite) registers
//
//*****************************************************************************

#define MCG_C1                        (*((volatile uint32_t *)0x40064000))      // MCG Control Register 1 (MCG_C1)
#define MCG_C2                        (*((volatile uint32_t *)0x40064001))      // MCG Control Register 2 (MCG_C2)
#define MCG_S                         (*((volatile uint32_t *)0x40064006))      // MCG Status Register (MCG_S)
#define MCG_SC                        (*((volatile uint32_t *)0x40064008))      // MCG Status and Control Register (MCG_SC)
#define MCG_MC                        (*((volatile uint32_t *)0x40064018))      // MCG Miscellaneous Control Register (MCG_MC)


//*****************************************************************************
//
// Oscillator (OSC) registers
//
//*****************************************************************************

#define OSC_CR                        (*((volatile uint32_t *)0x40065000))      // OSC Control Register


//*****************************************************************************
//
// Analog-to-Digital Converter (ADC) registers
//
//*****************************************************************************

