MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKL03Z16VFG4/mcu.h
#define DEVICETYPID                   0x7FFFFFFF80000000      // DEVICETYPID


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_PERIPHIDn register.
//
//*****************************************************************************

#define PERIPHID                      0x7FFFFFFF80000000      // PERIPHID


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_COMPIDn register.
//
//*****************************************************************************

#define COMPID                        0x7FFFFFFF80000000      // Component ID


//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_PERIPHIDn register.
//
//*****************************************************************************

#define PERIPHID                      0x7FFFFFFF80000000      // PERIPHID


//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_COMPIDn register.
//
//*****************************************************************************

#define COMPID                        0x7FFFFFFF80000000      // Component ID


//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_ENTRYn register.
//
//*****************************************************************************

#define ENTRY                         0x7FFFFFFF80000000      // ENTRY


//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_TABLEMARK register.
//
//*****************************************************************************

#define MARK                          0x7FFFFFFF80000000      // MARK


//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_SYSACCESS register.
//
//*****************************************************************************

#define SYSACCESS                     0x00000001      // SYSACCESS


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_C1 register.
//
//*****************************************************************************

#define CLKS                          0x00000180      // Clock Source Select
#define IRCLKEN                       0x00000002      // Internal Reference Clock Enable
#define IREFSTEN                      0x00000001      // Internal Reference Stop Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_C2 register.
//
//*****************************************************************************

#define EREFS0                        0x00000004      // External Clock Source Select
#define IRCS                          0x00000001      // Low-frequency Internal Reference Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_S register.
//
//*****************************************************************************

#define CLKST                         0x00000018      // Clock Mode Status
#define OSCINIT0                      0x00000002      // OSC Initialization Status


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_SC register.
//
//*****************************************************************************

#define FCRDIV                        0x00000038      // Low-frequency Internal Reference Clock Divider


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_MC register.
//
//*****************************************************************************

#define HIRCEN                        0x00000080      // High-frequency IRC Enable
#define LIRC_DIV2                     0x0000001C      // Second Low-frequency Internal Reference Clock Divider


//*****************************************************************************
//
// The following are defines for the bit fields in the OSC_CR register.
//
//*****************************************************************************

#define ERCLKEN                       0x00000080      // Enable External Reference Clock
#define 0                             0x00000040      // -
#define EREFSTEN                      0x00000020      // Enable External Reference Stop
#define 0                             0x00000010      // -
#define SC2P                          0x00000008      // Select Clock 2 divider to PLL/FLL clock
#define SC4P                          0x00000004      // Select Clock 4 divider to PLL/FLL clock
#define SC8P                          0x00000002      // Select Clock 8 divider to PLL/FLL clock
#define SC16P                         0x00000001      // Select Clock 16 divider to PLL/FLL clock


//*****************************************************************************
//
// The following are defines for the bit fields in the VREF_TRM register.
//
//*****************************************************************************

#define CHOPEN                        0x00000040      // Chop oscillator enable
#define TRIM                          0x000001F0      // Trim bits


//*****************************************************************************
//
// The following are defines for the bit fields in the VREF_SC register.
//
//*****************************************************************************

#define VREFEN                        0x00000080      // Internal Voltage Reference enable
#define REGEN                         0x00000040      // Regulator enable
#define ICOMPEN                       0x00000020      // Second order curvature compensation enable
#define 0                             0x00000030      // 0: ....;; 1: ....
#define VREFST                        0x00000004      // VREF status
#define MODE_LV                       0x00000002      // Buffer mode select


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_TSR register.
//
//*****************************************************************************

#define TSR                           0x7FFFFFFF80000000      // Time Seconds Register


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_TPR register.
//
//*****************************************************************************

